import { Values } from "@/features/values/Values";
import { get_simple_talk_question } from "./SimpleTalk.question";
import { QuestionDefine } from "../QuestionDefine";
import { get_choice_to_conclude_elf } from "./ConclusionElf.question";

export let RitualLosingElfEnd = get_simple_talk_question(`คุณได้ถ่วงเวลาเจ้าหมาป่า จนกระทั่งเครื่องอุปกรณ์ได้ปล่อยคลื่นพลังบางอย่างออกมาเป็นรัศมีวงกว้างจนไปถึงโดยรอบของหมู่บ้าน ร่างกายของเจ้าหมาป่าเริ่มเสื่อมสภาพ เชื้อราที่ติดตามตัวค่อยๆ ลอกออก ขนาดตัวของเจ้าสัตว์ร้ายเริ่มหดเล็กลงแล้วกลายสภาพเป็นร่างของชายชาวเอลฟ์คนหนึ่ง



“กระบวนการชำระล้าง เสร็จสิ้น”



หญิงสาวชาวเอลฟ์ล้มลงนอน ร่างของเธอซีดเผือดและผอมบางราวกับคนแก่ คุณก้มลงไปประคองศีรษะของหญิงสาว ปากของเธอขยับพร้อมแผ่วเสียงออกมาเบาๆ

“ช่วย…บอก…พี่ชายข้า ว่าข้า” ดวงตาของเธอค่อยๆ มืดบอด

“…รักเขา”



ทันทีที่เธอหมดลมหายใจ คุณก็ค่อยๆ ปิดตาของเธอแล้ววางศีรษะของหญิงสาวลงนอน ในขณะเดียวกัน ชายหนุ่มเอลฟ์คนนั้นก็ค่อยๆ ฟื้นตื่นขึ้น เขามองดูรอบๆ อย่างฉงน ก่อนจะตามมาด้วยอาการตื่นตกใจ

ทันทีที่เขาเหลือบไปเห็นร่างของหญิงสาว ชายคนนั้นก็รีบวิ่งมาหาเธอพร้อมกับกอดทั้งน้ำตา

“ไม่!” ยาร์นาสะอื้น “ข้าตั้งใจจะปกป้องเจ้า แล้วทำไมเจ้าถึงทำแบบนี้!”

“ยาร์รา!...ทำไม!”`,
    (values : Values, question_define : QuestionDefine)=>{
        return [
            get_choice_to_conclude_elf(values, question_define)
        ]
    }
)

export let RitualPurePotionEnd = get_simple_talk_question(`คุณได้ถ่วงเวลาเจ้าหมาป่า จนกระทั่งเครื่องอุปกรณ์ได้ปล่อยคลื่นพลังบางอย่างออกมาเป็นรัศมีวงกว้างจนไปถึงโดยรอบของหมู่บ้าน ร่างกายของเจ้าหมาป่าเริ่มเสื่อมสภาพ เชื้อราที่ติดตามตัวค่อยๆ ลอกออก ขนาดตัวของเจ้าสัตว์ร้ายเริ่มหดเล็กลงแล้วกลายสภาพเป็นร่างของชายชาวเอลฟ์คนหนึ่ง



“กระบวนการชำระล้าง เสร็จสิ้น”



หญิงสาวชาวเอลฟ์รีบวิ่งเข้าไปหาชายคนนั้น เธอกอดเขาพร้อมน้ำตา ในขณะที่ดวงตาของเขาค่อยๆ ลืมตื่นขึ้น

“ยาร์รา…นั่นน้องหรือ?” เขาพูดพร้อมกับจับใบหน้านาง

“ข้าเองพี่ข้า” เธอตอบแล้วกอดเขา "...ข้าเอง"`,
    (values : Values, question_define : QuestionDefine)=>{
        return [
            get_choice_to_conclude_elf(values, question_define)
        ]
    }
)

export let RitualDetroyAllEnd = get_simple_talk_question(`คุณไม่รู้ว่าจะหยุดเชื้อพวกนี้ได้อย่างไร มันจึงไม่มีทางเลือกอื่นนอกจากต้องทำลายเครื่องอุปกรณ์นี้ทิ้งเสีย

ในทันทีที่สิ่งนั้นได้กลายเป็นเศษ จู่ๆ เจ้าหมาป่ายักษ์ก็พุ่งกระโจนออกมาเพื่อหวังจะฆ่าคุณ แล้วทันใดนั้น ซากอุปกรณ์นั้นก็ระเบิดคลื่นพลังงานบางอย่างออกเป็นวงกว้าง เจ้าหมาป่ายักษ์ที่สัมผัสโดนคลื่น ก็ได้สลายกลายเป็นฝุ่นผงภายในชั่วพริบตา

คุณชะงักอยู่ครู่หนึ่ง ก่อนจะเก็บอาวุธลง คุณรู้สึกได้ว่าบรรยากาศภายในโบราณสถานดูแตกต่างออกไป…ราวกับว่าสิ่งมีชีวิตที่ติดเชื้อในนี้ ได้หายไปหมดสิ้น`,
    (values : Values, question_define : QuestionDefine)=>{
        return [
            get_choice_to_conclude_elf(values, question_define)
        ]
    }
)