
let opend_mystery_room = `หลังจากที่คุณงัดเข้ามาได้ พวกคุณก็ได้พบกับห้องวิจัยที่เต็มไปด้วยวัตถุดิบปรุงยามากมาย เศษกระดาษคำภีร์เวทมนตร์วางเกลื่อนเต็มพื้น จนกระทั่งสายตาของคุณได้ไปสะดุดเข้ากับบันทึกเล่มหนึ่งที่วางอยู่ที่โต๊ะทำงานของใครบางคน คุณได้ลองเปิดอ่านดู แต่ตัวหนังสือทั้งหมดนั้นถูกเขียนด้วยภาษาเอลฟ์`

let elf_tell_story = `“พี่ชายของฉัน…ยาร์นา… เขามาที่นี่แล้วหยุดพิธีกรรมของเจ้าวอร์ล็อกผู้ชั่วร้ายได้…แต่กระนั้น สิ่งที่เจ้าวายร้ายนั่นอัญเชิญมา มันคือเชื้อโรคที่จะกลายพันธ์ุให้สิ่งมีชีวิตเป็นอสูร…เขาพยายามที่จะประดิษฐ์อุปกรณ์ที่จะกำจัดเชื้อพวกนั้นให้หมด แล้วทำให้ทุกอย่างกลับมาเป็นปกติ…แต่นั่นจำเป็นต้องใช้สิ่งที่บริสุทธิ์เทียบเท่ากับน้ำยา Pure Potion…เลือดทั้งตัวของหญิงพรหมจรรย์แห่งตระกูลเอลฟ์ศักดิ์สิทธิ์…เลือดของข้า…แต่การกระทำอย่างนั้นมันจะส่งผลทำให้ข้าตาย…พี่ชายข้าเลย…” หญิงสาวปิดบันทึก “เขาเสียสละโดยการใช้เลือดบางส่วนของตนเองผสมกับน้ำยาศักดิ์สิทธิ์แทน…ถึงแม้ว่านั่นจะไม่ทำให้เขาตาย แต่มันก็ทำให้ภูมิต้านทานของเขาอ่อนแอ…ร่างกายของเขาที่ติดเชื้อเริ่มกลายพันธ์ุเป็นหมาป่า แล้วก็….”

หญิงสาวสะอื้น “เขาพยายามจะปกป้องข้า…ข้าคิดว่าการทดลองก็คงจะล้มเหลว…และตอนนี้เขาก็ได้กลายเป็นหมาป่าที่เฝ้าที่นี่แทน”`

export let mystery_room_alone_first_time = `${opend_mystery_room}

คุณที่ไม่รู้ศัพท์ ทำได้แต่เพียงปิดบันทึกนั้นลง`

export let mystery_room_alone_default_not_read = `คุณได้เดินทางกลับมายังทางเดินซึ่งมีประตูสู่ห้องวิจัยทำงานของใครบางคน`

export let mystery_room_alone_default_read = `คุณได้เดินทางกลับมายังทางเดินซึ่งมีประตูสู่ห้องวิจัยทำงานของยาร์นา`

export let mystery_room_elf_first_time = `${opend_mystery_room}

ด้วยความที่คุณที่ไม่รู้ศัพท์ คุณจึงได้ยื่นส่งบันทึกเล่มนั้นให้กับหญิงสาว เธอรับมันมา แล้วอ่านเนื้อความข้างใน แต่ทว่ายิ่งอ่านไปเท่าไหร่ สายตาของเธอก็ยิ่งเบิกกว้างมากขึ้น คุณที่สงสัยว่าหญิงสาวอ่านไปเจอเข้ากับอะไรก็ได้ถาม เธอหันหน้ามาแล้วบอก

${elf_tell_story}`

export let mystery_room_elf_again = `คุณได้กลับมายังห้องวิจัยนี้อีกครั้งหนึ่งเพราะสงสัยว่าบันทึกที่ตนได้พบเจอนั้นได้เขียนอะไรไว้ คุณจึงได้ไปหยิบแล้วยื่นส่งบันทึกเล่มนั้นให้กับหญิงสาว เธอรับมันมา แล้วอ่านเนื้อความข้างใน แต่ทว่ายิ่งอ่านไปเท่าไหร่ สายตาของเธอก็ยิ่งเบิกกว้างมากขึ้น คุณที่สงสัยว่าหญิงสาวอ่านไปเจอเข้ากับอะไรก็ได้ถาม เธอหันหน้ามาแล้วบอก

${elf_tell_story}`